In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('sample_hours_rate.csv')

In [17]:
pd.set_option('display.max_rows', 500)

In [18]:
pd.options.display.max_rows

500

In [14]:
df.size

30

In [15]:
df.shape

(10, 3)

In [21]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [19]:
df.head()

              name  hours    rate
0     Katell Bryan     50  $41.94
1  Addison Walters     45  $15.26
2       Veda Stein     36  $34.19
3     Jocelyn Shaw     36  $16.13
4   Shelley Waters     42  $37.78

In [20]:
df.tail()

               name  hours    rate
5  Arthur Frederick     23  $24.61
6    Hollee Stanley     41  $23.98
7     Brennan Avery     40  $39.47
8     Dacey Goodwin     15  $44.42
9     Karyn Harding     46  $49.01